tmp/wsl_quad_bench/arc_run1.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    89.30ms  213.73ms   1.91s    92.57%
    Req/Sec   243.05    221.23     1.19k    72.41%
  Latency Distribution
     50%   29.34ms
     75%   51.39ms
     90%  100.77ms
     99%    1.08s 
  14510 requests in 10.02s, 3.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 20
Requests/sec:   1448.33
Transfer/sec:    319.65KB