tmp/wsl_quad_bench/arc_run2.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   103.43ms  209.06ms   1.99s    92.78%
    Req/Sec   188.13    148.34     0.85k    70.56%
  Latency Distribution
     50%   44.80ms
     75%   74.58ms
     90%  139.51ms
     99%    1.09s 
  14477 requests in 10.02s, 3.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 34
Requests/sec:   1444.13
Transfer/sec:    318.72KB