tmp/wsl_quad_bench/backend_run1.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    51.78ms  104.35ms   1.75s    98.01%
    Req/Sec   211.14    158.58     1.05k    75.07%
  Latency Distribution
     50%   31.85ms
     75%   55.55ms
     90%   83.81ms
     99%  359.76ms
  15259 requests in 10.02s, 2.94MB read
  Socket errors: connect 0, read 0, write 0, timeout 15
Requests/sec:   1522.30
Transfer/sec:    300.34KB