tmp/wsl_quad_bench/backend_run2.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.52ms   76.06ms   1.70s    98.15%
    Req/Sec   265.98    228.93     1.28k    69.50%
  Latency Distribution
     50%   28.37ms
     75%   44.73ms
     90%   66.08ms
     99%  160.72ms
  14950 requests in 10.03s, 2.88MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:   1490.83
Transfer/sec:    294.15KB