tmp/wsl_quad_bench/backend_run3.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.59ms   66.53ms   1.68s    98.04%
    Req/Sec   259.36    190.84   737.00     60.45%
  Latency Distribution
     50%   25.20ms
     75%   41.51ms
     90%   63.48ms
     99%  127.63ms
  14984 requests in 10.01s, 2.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 17
Requests/sec:   1496.30
Transfer/sec:    295.25KB