tmp/wsl_quad_bench/nginx_run1.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    66.42ms  166.47ms   1.88s    95.20%
    Req/Sec   284.34    205.56     1.01k    58.85%
  Latency Distribution
     50%   25.81ms
     75%   44.14ms
     90%   73.60ms
     99%    1.03s 
  14747 requests in 10.02s, 2.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 64
Requests/sec:   1471.73
Transfer/sec:    301.82KB