tmp/wsl_quad_bench/nginx_run2.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   103.98ms  213.40ms   1.96s    93.18%
    Req/Sec   226.02    146.48   720.00     60.27%
  Latency Distribution
     50%   44.67ms
     75%   75.94ms
     90%  142.74ms
     99%    1.11s 
  14871 requests in 10.02s, 2.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 34
Requests/sec:   1483.60
Transfer/sec:    304.25KB