tmp/wsl_quad_bench/nginx_run3.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.73ms  172.86ms   1.90s    95.12%
    Req/Sec   223.74    161.20   717.00     54.49%
  Latency Distribution
     50%   38.78ms
     75%   67.05ms
     90%  113.71ms
     99%    1.05s 
  14919 requests in 10.02s, 2.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 53
Requests/sec:   1488.27
Transfer/sec:    305.21KB