tmp/wsl_quad_bench/pingora_min_run2.txt
Running 10s test @ http://127.0.0.1:8082/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   109.39ms  218.07ms   1.98s    93.42%
    Req/Sec   185.20     96.03   600.00     73.47%
  Latency Distribution
     50%   51.36ms
     75%   85.37ms
     90%  154.21ms
     99%    1.14s 
  14522 requests in 10.02s, 3.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 36
Requests/sec:   1449.33
Transfer/sec:    319.87KB