tmp/wsl_quad_bench/pingora_min_run3.txt
Running 10s test @ http://127.0.0.1:8082/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   109.18ms  203.59ms   1.99s    93.50%
    Req/Sec   179.46    113.32   700.00     71.61%
  Latency Distribution
     50%   54.20ms
     75%   86.99ms
     90%  157.27ms
     99%    1.10s 
  14128 requests in 10.02s, 3.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 54
Requests/sec:   1410.33
Transfer/sec:    311.27KB